<template>
    <div class="careplan-add">
        <a-breadcrumb style="margin-bottom:10px">
            <a-breadcrumb-item>照顾计划管理</a-breadcrumb-item>
            <a-breadcrumb-item>新增页面</a-breadcrumb-item>
        </a-breadcrumb>
        <div class="careplan-add-body">
            <div class="select-plan">
                <div class="selected-header">
                    <div class="header-item" v-for="item in headerTypes">
                        <a-tooltip placement="bottom">
                            <template #title>
                                <div class="item-list">
                                    <div class="item" @click="handlerReloadList(it)" v-for="it in item.children">
                                        <span>{{it.dictValue}}</span>
                                    </div>
                                </div>
                            </template>
                            <div @click="handlerReloadList(item)" class="header-item-container">
                                <svg v-if="item.dictValue == '健康信息'" xmlns="http://www.w3.org/2000/svg" width="16"
                                    height="17" viewBox="0 0 16 17" fill="none">
                                    <g clip-path="url(#clip0_307_43277)">
                                        <rect width="16" height="16" transform="translate(0 0.5)" fill="white" />
                                        <path
                                            d="M3.11117 0.944336H12.8889C13.6254 0.944336 14.2223 1.56967 14.2223 2.34078V14.647C14.2223 15.4181 13.6254 16.0434 12.8889 16.0434C12.7072 16.0434 12.5276 16.0043 12.3605 15.9292L8.04405 13.9781L3.63339 15.9434C2.95561 16.2457 2.1725 15.915 1.8845 15.2057C1.81403 15.032 1.77781 14.8464 1.77783 14.659V2.34034C1.77783 1.56967 2.37472 0.944336 3.11117 0.944336Z"
                                            fill="#F96574" />
                                        <path
                                            d="M4.00011 3.16699H5.33344C5.62974 3.16699 5.77789 3.31514 5.77789 3.61144C5.77789 3.90773 5.62974 4.05588 5.33344 4.05588H4.00011C3.70381 4.05588 3.55566 3.90773 3.55566 3.61144C3.55566 3.31514 3.70381 3.16699 4.00011 3.16699Z"
                                            fill="white" />
                                        <path
                                            d="M10.6666 11.6113H11.9999C12.2962 11.6113 12.4444 11.7595 12.4444 12.0558C12.4444 12.3521 12.2962 12.5002 11.9999 12.5002H10.6666C10.3703 12.5002 10.2222 12.3521 10.2222 12.0558C10.2222 11.7595 10.3703 11.6113 10.6666 11.6113Z"
                                            fill="white" />
                                        <path
                                            d="M4.00011 3.16699C4.2964 3.16699 4.44455 3.31514 4.44455 3.61144V4.94477C4.44455 5.24107 4.2964 5.38921 4.00011 5.38921C3.70381 5.38921 3.55566 5.24107 3.55566 4.94477V3.61144C3.55566 3.31514 3.70381 3.16699 4.00011 3.16699Z"
                                            fill="white" />
                                        <path
                                            d="M12.0001 10.2773C12.2964 10.2773 12.4446 10.4255 12.4446 10.7218V12.0551C12.4446 12.3514 12.2964 12.4996 12.0001 12.4996C11.7038 12.4996 11.5557 12.3514 11.5557 12.0551V10.7218C11.5557 10.4255 11.7038 10.2773 12.0001 10.2773Z"
                                            fill="white" />
                                        <path
                                            d="M10.5651 5.91481C10.2217 5.58697 9.768 5.39951 9.29333 5.38931C8.81867 5.37911 8.35737 5.54691 8.00019 5.85969C7.64298 5.54679 7.18159 5.37891 6.70682 5.38911C6.23205 5.39931 5.77829 5.58684 5.43485 5.91481C5.26252 6.07965 5.12536 6.2777 5.03166 6.49701C4.93796 6.71631 4.88965 6.95232 4.88965 7.19081C4.88965 7.42929 4.93796 7.6653 5.03166 7.8846C5.12536 8.10391 5.26252 8.30196 5.43485 8.4668L7.58374 10.5512C7.69462 10.6607 7.84416 10.7221 7.99997 10.7221C8.15577 10.7221 8.30531 10.6607 8.41619 10.5512L10.5655 8.46903C10.7382 8.30415 10.8757 8.10596 10.9696 7.88645C11.0635 7.66694 11.1119 7.43067 11.1119 7.19192C11.1119 6.95316 11.0635 6.71689 10.9696 6.49738C10.8757 6.27787 10.7382 6.07968 10.5655 5.91481H10.5651Z"
                                            fill="white" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_307_43277">
                                            <rect width="16" height="16" fill="white" transform="translate(0 0.5)" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                <svg v-else-if="item.dictValue == '中医体质'" xmlns="http://www.w3.org/2000/svg" width="17"
                                    height="17" viewBox="0 0 17 17" fill="none">
                                    <g clip-path="url(#clip0_307_43289)">
                                        <rect width="17" height="17" fill="white" />
                                        <path
                                            d="M2.361 2.36133H14.6388C15.5832 2.36133 16.0554 2.83355 16.0554 3.77799V11.3336C16.0554 12.278 15.5832 12.7502 14.6388 12.7502H2.361C1.41656 12.7502 0.944336 12.278 0.944336 11.3336V3.77799C0.944336 2.83355 1.41656 2.36133 2.361 2.36133Z"
                                            fill="#54B674" />
                                        <path
                                            d="M12.6634 5.67628L12.7182 5.68667C12.7182 5.68667 12.8178 7.06745 12.6634 7.85748C12.6634 7.85748 12.3267 9.55417 11.2354 10.1865C11.1627 10.2389 10.0898 10.9557 8.79829 10.8504C8.79829 10.8504 9.88959 8.27917 10.7991 7.40462C10.2626 7.85795 8.76192 9.20662 8.5617 10.3447C8.5617 10.3447 7.96151 7.60484 10.4988 6.2557L10.5082 6.24531C10.6168 6.19289 11.7265 5.58137 12.6634 5.67628ZM5.97534 7.02023C7.9412 7.9812 7.51667 10.0165 7.51667 10.0165C7.34148 9.16931 6.1784 8.19842 5.75387 7.86739L5.74442 7.857C6.4367 8.46664 7.30465 10.3163 7.33204 10.3782C6.31676 10.4712 5.45826 9.91306 5.45826 9.91306C4.62762 9.47909 4.34145 8.22912 4.34145 8.22912C4.24937 7.83623 4.23095 7.30923 4.26779 6.62734C5.02476 6.514 5.97534 7.02023 5.97534 7.02023ZM6.26434 3.77748C6.86595 3.76803 7.53698 4.26528 7.53698 4.26528C8.93854 5.22106 8.39642 6.80442 8.39642 6.80442C8.35392 6.11734 7.57145 5.23098 7.27867 4.92262L7.27017 4.9127L7.28765 4.93253C7.75184 5.50014 8.19904 7.02306 8.21604 7.08303C7.71642 7.05706 7.23334 6.86723 6.82298 6.53525C6.2209 6.08759 6.14392 5.06192 6.14392 5.06192C6.10945 4.58403 6.26434 3.77748 6.26434 3.77748Z"
                                            fill="white" />
                                        <path
                                            d="M4.72222 13.6943H12.2778C12.5926 13.6943 12.75 13.8517 12.75 14.1666C12.75 14.4814 12.5926 14.6388 12.2778 14.6388H4.72222C4.40741 14.6388 4.25 14.4814 4.25 14.1666C4.25 13.8517 4.40741 13.6943 4.72222 13.6943Z"
                                            fill="#54B674" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_307_43289">
                                            <rect width="17" height="17" fill="white" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                <svg v-else-if="item.dictValue == '评估结果'" xmlns="http://www.w3.org/2000/svg" width="17"
                                    height="17" viewBox="0 0 17 17" fill="none">
                                    <rect width="17" height="17" fill="white" />
                                    <path
                                        d="M14.042 15.6854H2.958C2.79012 15.6712 2.63363 15.5948 2.51932 15.471C2.405 15.3473 2.34115 15.1852 2.34033 15.0167V3.31507C2.34186 3.14709 2.40602 2.98573 2.52027 2.86258C2.63451 2.73942 2.79061 2.66334 2.958 2.64923H4.03467V3.31507C4.02934 3.66182 4.16124 3.99664 4.40164 4.24659C4.64204 4.49655 4.97146 4.64139 5.31817 4.64957C5.66487 4.64139 5.99429 4.49655 6.23469 4.24659C6.47509 3.99664 6.60699 3.66182 6.60167 3.31507V2.64923H7.2165V3.31507C7.2165 3.48362 7.2497 3.65052 7.3142 3.80624C7.3787 3.96196 7.47324 4.10346 7.59243 4.22264C7.71161 4.34182 7.8531 4.43636 8.00882 4.50087C8.16455 4.56537 8.33145 4.59857 8.5 4.59857C8.66855 4.59857 8.83545 4.56537 8.99117 4.50087C9.14689 4.43636 9.28839 4.34182 9.40757 4.22264C9.52675 4.10346 9.6213 3.96196 9.6858 3.80624C9.7503 3.65052 9.7835 3.48362 9.7835 3.31507V2.64923H10.3983V3.31507C10.3983 3.65547 10.5336 3.98194 10.7743 4.22264C11.015 4.46334 11.3414 4.59857 11.6818 4.59857C12.0222 4.59857 12.3487 4.46334 12.5894 4.22264C12.8301 3.98194 12.9653 3.65547 12.9653 3.31507V2.64923H14.042C14.1265 2.65178 14.2096 2.67109 14.2865 2.70606C14.3635 2.74102 14.4327 2.79093 14.4902 2.85289C14.5477 2.91484 14.5922 2.98761 14.6213 3.06696C14.6504 3.1463 14.6635 3.23064 14.6597 3.31507V15.0167C14.6588 15.1852 14.595 15.3473 14.4807 15.471C14.3664 15.5948 14.2099 15.6712 14.042 15.6854ZM12.2995 6.4969H4.7005C4.61602 6.4998 4.53296 6.51948 4.45615 6.55478C4.37934 6.59008 4.31032 6.64031 4.25311 6.70253C4.19589 6.76476 4.15163 6.83774 4.12288 6.91723C4.09413 6.99672 4.08148 7.08114 4.08567 7.16557C4.08648 7.33329 4.15003 7.49463 4.26382 7.61785C4.3776 7.74107 4.53338 7.81725 4.7005 7.8314H12.3505C12.4349 7.82887 12.5179 7.80954 12.5946 7.77454C12.6714 7.73954 12.7405 7.68958 12.7977 7.62758C12.855 7.56558 12.8993 7.49279 12.9281 7.41346C12.9568 7.33413 12.9695 7.24985 12.9653 7.16557C12.9624 6.98962 12.8914 6.82164 12.7673 6.69694C12.6431 6.57225 12.4754 6.50054 12.2995 6.4969ZM12.2995 9.42373H4.7005C4.61602 9.42664 4.53296 9.44631 4.45615 9.48161C4.37934 9.51691 4.31032 9.56714 4.25311 9.62936C4.19589 9.69159 4.15163 9.76457 4.12288 9.84406C4.09413 9.92356 4.08148 10.008 4.08567 10.0924C4.08501 10.2614 4.14783 10.4245 4.26169 10.5494C4.37555 10.6742 4.53216 10.7518 4.7005 10.7667H12.3505C12.4347 10.7638 12.5175 10.7442 12.5942 10.7091C12.6708 10.674 12.7397 10.624 12.7968 10.5621C12.854 10.5002 12.8983 10.4275 12.9273 10.3484C12.9562 10.2692 12.9691 10.1851 12.9653 10.1009C12.9693 10.0119 12.9548 9.92303 12.9229 9.83985C12.891 9.75667 12.8422 9.68095 12.7798 9.61742C12.7173 9.55389 12.6424 9.50391 12.5598 9.47058C12.4772 9.43726 12.3886 9.42131 12.2995 9.42373ZM12.4667 12.2996H4.5475C4.4759 12.3009 4.40532 12.3169 4.34013 12.3465C4.27494 12.3761 4.21651 12.4188 4.16846 12.4719C4.1204 12.525 4.08374 12.5874 4.06073 12.6552C4.03772 12.723 4.02885 12.7949 4.03467 12.8662C4.03403 13.0076 4.08628 13.1442 4.18117 13.249C4.27606 13.3539 4.40673 13.4195 4.5475 13.4329H12.4015C12.473 13.4312 12.5434 13.4149 12.6083 13.3852C12.6733 13.3554 12.7316 13.3127 12.7796 13.2597C12.8276 13.2067 12.8642 13.1444 12.8874 13.0768C12.9106 13.0092 12.9197 12.9375 12.9143 12.8662C12.9251 12.7992 12.9219 12.7307 12.9048 12.665C12.8877 12.5992 12.8571 12.5378 12.815 12.4845C12.7729 12.4313 12.7202 12.3873 12.6603 12.3555C12.6003 12.3236 12.5344 12.3046 12.4667 12.2996ZM11.6818 4.03473C11.5974 4.03183 11.5143 4.01216 11.4375 3.97686C11.3607 3.94155 11.2917 3.89133 11.2344 3.8291C11.1772 3.76688 11.133 3.6939 11.1042 3.6144C11.0755 3.53491 11.0628 3.4505 11.067 3.36607V1.9834C11.0613 1.89896 11.073 1.81424 11.1013 1.73451C11.1297 1.65477 11.1742 1.58171 11.232 1.51988C11.2897 1.45804 11.3596 1.40873 11.4372 1.37503C11.5149 1.34132 11.5986 1.32392 11.6832 1.32392C11.7679 1.32392 11.8516 1.34132 11.9292 1.37503C12.0069 1.40873 12.0768 1.45804 12.1345 1.51988C12.1923 1.58171 12.2368 1.65477 12.2652 1.73451C12.2935 1.81424 12.3052 1.89896 12.2995 1.9834V3.31507C12.3084 3.40331 12.2994 3.49245 12.2728 3.57708C12.2462 3.66171 12.2028 3.74005 12.145 3.80736C12.0872 3.87466 12.0164 3.92953 11.9368 3.96861C11.8571 4.0077 11.7704 4.03019 11.6818 4.03473ZM8.5 4.03473C8.41552 4.03183 8.33246 4.01216 8.25565 3.97686C8.17884 3.94155 8.10982 3.89133 8.05261 3.8291C7.99539 3.76688 7.95113 3.6939 7.92238 3.6144C7.89363 3.53491 7.88098 3.4505 7.88517 3.36607V1.9834C7.87693 1.8977 7.8867 1.81122 7.91385 1.72952C7.941 1.64782 7.98493 1.57269 8.04283 1.50897C8.10072 1.44524 8.1713 1.39433 8.25003 1.35948C8.32876 1.32464 8.4139 1.30664 8.5 1.30664C8.58609 1.30664 8.67124 1.32464 8.74997 1.35948C8.8287 1.39433 8.89928 1.44524 8.95717 1.50897C9.01506 1.57269 9.059 1.64782 9.08615 1.72952C9.1133 1.81122 9.12307 1.8977 9.11483 1.9834V3.31507C9.12419 3.40316 9.11549 3.49224 9.08926 3.57686C9.06303 3.66147 9.01983 3.73985 8.96228 3.80721C8.90474 3.87456 8.83407 3.92948 8.75458 3.9686C8.6751 4.00772 8.58847 4.03022 8.5 4.03473ZM5.31817 4.03473C5.23344 4.0322 5.15007 4.0128 5.07294 3.97766C4.9958 3.94252 4.92645 3.89235 4.86894 3.83009C4.81142 3.76782 4.7669 3.69472 4.73798 3.61504C4.70906 3.53537 4.69632 3.45073 4.7005 3.36607V1.9834C4.69477 1.89896 4.70646 1.81424 4.73483 1.73451C4.76321 1.65477 4.80767 1.58171 4.86545 1.51988C4.92324 1.45804 4.99311 1.40873 5.07075 1.37503C5.14838 1.34132 5.23211 1.32392 5.31675 1.32392C5.40138 1.32392 5.48512 1.34132 5.56275 1.37503C5.64038 1.40873 5.71026 1.45804 5.76804 1.51988C5.82583 1.58171 5.87029 1.65477 5.89867 1.73451C5.92704 1.81424 5.93873 1.89896 5.933 1.9834V3.31507C5.94236 3.40316 5.93366 3.49224 5.90743 3.57686C5.8812 3.66147 5.83799 3.73985 5.78045 3.80721C5.7229 3.87456 5.65223 3.92948 5.57275 3.9686C5.49326 4.00772 5.40664 4.03022 5.31817 4.03473Z"
                                        fill="#4D8FBE" />
                                </svg>
                                <svg v-else-if="item.dictValue == '饮食评估'" xmlns="http://www.w3.org/2000/svg" width="17"
                                    height="17" viewBox="0 0 17 17" fill="none">
                                    <g clip-path="url(#clip0_307_43300)">
                                        <rect width="17" height="17" fill="white" />
                                        <path
                                            d="M0.944336 8.49989C0.944336 9.4921 1.13977 10.4746 1.51947 11.3913C1.89917 12.308 2.45571 13.1409 3.15731 13.8425C3.85891 14.5441 4.69182 15.1006 5.60851 15.4803C6.52519 15.86 7.50768 16.0554 8.49989 16.0554C9.4921 16.0554 10.4746 15.86 11.3913 15.4803C12.308 15.1006 13.1409 14.5441 13.8425 13.8425C14.5441 13.1409 15.1006 12.308 15.4803 11.3913C15.86 10.4746 16.0554 9.4921 16.0554 8.49989C16.0554 6.49603 15.2594 4.57425 13.8425 3.15731C12.4255 1.74037 10.5037 0.944336 8.49989 0.944336C6.49603 0.944336 4.57425 1.74037 3.15731 3.15731C1.74037 4.57425 0.944336 6.49603 0.944336 8.49989Z"
                                            fill="#FED44D" />
                                        <path
                                            d="M4.25 8.09874C4.45542 4.94808 9.78775 5.76124 9.78775 5.76124L10.7105 5.9643C15.0171 7.08205 11.7357 12.3667 7.94183 11.757C4.48233 11.2008 4.26228 8.61724 4.25 8.1658V8.09874ZM8.5 6.13902C6.67439 6.13902 5.19444 6.77322 5.19444 7.55569C5.19444 8.33816 6.67439 8.97236 8.5 8.97236C10.3256 8.97236 11.8056 8.33816 11.8056 7.55569C11.8056 6.77322 10.3256 6.13902 8.5 6.13902Z"
                                            fill="white" />
                                        <path
                                            d="M9.53088 6.89154C9.53088 6.89154 7.76997 6.61482 7.57447 7.26035C7.37897 7.90635 8.74794 8.64443 9.82413 7.16826C10.8999 5.6921 11.5846 5.13865 12.4653 5.0461C13.3455 4.95401 11.9761 3.56993 11.1936 4.67729C10.4111 5.78418 9.53088 6.89154 9.53088 6.89154Z"
                                            fill="white" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_307_43300">
                                            <rect width="17" height="17" fill="white" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                <svg v-else-if="item.dictValue == '居家安全'" xmlns="http://www.w3.org/2000/svg" width="17"
                                    height="17" viewBox="0 0 17 17" fill="none">
                                    <g clip-path="url(#clip0_307_43307)">
                                        <rect width="17" height="17" fill="white" />
                                        <path
                                            d="M4.25016 8.5H12.7502C13.6946 8.5 14.1668 8.97222 14.1668 9.91667V14.1667C14.1668 15.1111 13.6946 15.5833 12.7502 15.5833H4.25016C3.30572 15.5833 2.8335 15.1111 2.8335 14.1667V9.91667C2.8335 8.97222 3.30572 8.5 4.25016 8.5Z"
                                            fill="#7AC693" />
                                        <path
                                            d="M15.7366 7.72261L9.31865 1.73011C9.09484 1.52642 8.80244 1.41462 8.49982 1.41703C8.19051 1.41703 7.89537 1.53036 7.68099 1.72964L1.26301 7.72214C0.570263 8.36956 1.08121 9.44481 2.08185 9.44481H14.9173C15.918 9.44481 16.4289 8.36909 15.7362 7.72261H15.7366Z"
                                            fill="#7AC693" />
                                        <path
                                            d="M7.31934 7.05371C7.58797 6.89623 7.88509 6.79344 8.1936 6.75126C8.50212 6.70908 8.81593 6.72833 9.11697 6.80792C9.41801 6.88751 9.70033 7.02586 9.94768 7.21501C10.195 7.40415 10.4025 7.64036 10.5582 7.91002C10.7139 8.17969 10.8147 8.47748 10.8549 8.78627C10.895 9.09506 10.8737 9.40873 10.7921 9.70924C10.7105 10.0097 10.5703 10.2911 10.3795 10.5372C10.1887 10.7833 9.95114 10.9893 9.68045 11.1432C9.13844 11.4513 8.49654 11.5326 7.89483 11.3692C7.29312 11.2059 6.78045 10.8111 6.46869 10.2712C6.15694 9.73123 6.07141 9.08988 6.23078 8.4871C6.39015 7.88432 6.78147 7.36904 7.31934 7.05371ZM7.79156 7.8716C7.62915 7.96394 7.48661 8.0875 7.37214 8.23515C7.25767 8.38281 7.17354 8.55165 7.12458 8.73195C7.07563 8.91226 7.06283 9.10046 7.08691 9.28573C7.11099 9.471 7.17148 9.64968 7.2649 9.81148C7.35832 9.97328 7.48282 10.115 7.63123 10.2285C7.77964 10.342 7.94903 10.425 8.12966 10.4727C8.31028 10.5205 8.49857 10.532 8.68368 10.5067C8.86878 10.4814 9.04706 10.4198 9.20823 10.3253C9.53096 10.1361 9.76575 9.8269 9.86137 9.46524C9.95699 9.10357 9.90567 8.71876 9.71862 8.39478C9.53157 8.07081 9.22397 7.83397 8.86294 7.73596C8.50191 7.63794 8.11677 7.6867 7.79156 7.8716Z"
                                            fill="white" />
                                        <path
                                            d="M9.03564 10.9703L9.85353 10.498L11.0341 12.5428L10.2162 13.015L9.03564 10.9703Z"
                                            fill="white" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_307_43307">
                                            <rect width="17" height="17" fill="white" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                <svg v-else xmlns="http://www.w3.org/2000/svg" width="15" height="15" viewBox="0 0 15 15"
                                    fill="none">
                                    <g clip-path="url(#clip0_307_43315)">
                                        <rect width="15" height="15" fill="white" />
                                        <path
                                            d="M0.833496 6.25H14.1668V12.5C14.1668 12.6642 14.1345 12.8267 14.0717 12.9784C14.0089 13.13 13.9168 13.2678 13.8007 13.3839C13.6846 13.5 13.5468 13.592 13.3952 13.6549C13.2435 13.7177 13.081 13.75 12.9168 13.75H2.0835C1.91934 13.75 1.7568 13.7177 1.60514 13.6549C1.45348 13.592 1.31569 13.5 1.19961 13.3839C1.08354 13.2678 0.991465 13.13 0.928647 12.9784C0.865828 12.8267 0.833496 12.6642 0.833496 12.5V6.25ZM2.0835 2.91667H12.9168C13.2483 2.91667 13.5663 3.04836 13.8007 3.28278C14.0351 3.5172 14.1668 3.83515 14.1668 4.16667V5.625H0.833496V4.16667C0.833496 3.83515 0.965192 3.5172 1.19961 3.28278C1.43403 3.04836 1.75198 2.91667 2.0835 2.91667ZM5.8335 1.25H9.16683C9.33098 1.25 9.49353 1.28233 9.64518 1.34515C9.79684 1.40797 9.93464 1.50004 10.0507 1.61612C10.1668 1.73219 10.2589 1.86999 10.3217 2.02165C10.3845 2.1733 10.4168 2.33585 10.4168 2.5V2.91667H4.5835V2.5C4.5835 2.33585 4.61583 2.1733 4.67865 2.02165C4.74146 1.86999 4.83354 1.73219 4.94961 1.61612C5.06569 1.50004 5.20348 1.40797 5.35514 1.34515C5.5068 1.28233 5.66934 1.25 5.8335 1.25Z"
                                            fill="#F96574" />
                                        <path
                                            d="M5.83317 9.58301H9.1665C9.44428 9.58301 9.58317 9.7219 9.58317 9.99967C9.58317 10.2775 9.44428 10.4163 9.1665 10.4163H5.83317C5.55539 10.4163 5.4165 10.2775 5.4165 9.99967C5.4165 9.7219 5.55539 9.58301 5.83317 9.58301Z"
                                            fill="white" />
                                        <path
                                            d="M7.91683 8.33366V11.667C7.91683 11.9448 7.77794 12.0837 7.50016 12.0837C7.22239 12.0837 7.0835 11.9448 7.0835 11.667V8.33366C7.0835 8.05588 7.22239 7.91699 7.50016 7.91699C7.77794 7.91699 7.91683 8.05588 7.91683 8.33366Z"
                                            fill="white" />
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_307_43315">
                                            <rect width="15" height="15" fill="white" />
                                        </clipPath>
                                    </defs>
                                </svg>
                                <span>{{ item.dictValue }}</span>
                                <svg v-if="item.children.length !=0" xmlns="http://www.w3.org/2000/svg" width="11" height="7" viewBox="0 0 11 7"
                                    fill="none">
                                    <path d="M1.75 1.375L5.5 5.625L9.25 1.375" stroke="#54B674" stroke-width="2"
                                        stroke-linecap="round" stroke-linejoin="round" />
                                </svg>
                            </div>
                        </a-tooltip>
                    </div>
                </div>
                <span style="margin-top: 10px;">选择计划</span>
                <div class="select-table">
                    <a-table :border="true" :align="'center'" :pagination="false" style="min-height:400px"
                        :columns="columns" :data-source="dataSource"
                        :row-selection="{ selectedRowKeys: selectedKeys, onChange: onSelectChange }">
                        <template #bodyCell="{ column, text, record }">
                            <template v-if="column.dataIndex == 'price'">
                                <span>{{ record.price }} 元/次</span>
                            </template>
                            <template v-if="column.dataIndex == 'operation'">
                                <div class="editor-row">
                                    <svg @click="handlerReduce(record)" xmlns="http://www.w3.org/2000/svg" width="18"
                                        height="18" viewBox="0 0 18 18" fill="none">
                                        <path
                                            d="M5.76562 9.5625H12.2344C12.3117 9.5625 12.375 9.49922 12.375 9.42188V8.57812C12.375 8.50078 12.3117 8.4375 12.2344 8.4375H5.76562C5.68828 8.4375 5.625 8.50078 5.625 8.57812V9.42188C5.625 9.49922 5.68828 9.5625 5.76562 9.5625ZM15.4688 1.96875H2.53125C2.22012 1.96875 1.96875 2.22012 1.96875 2.53125V15.4688C1.96875 15.7799 2.22012 16.0312 2.53125 16.0312H15.4688C15.7799 16.0312 16.0312 15.7799 16.0312 15.4688V2.53125C16.0312 2.22012 15.7799 1.96875 15.4688 1.96875ZM14.7656 14.7656H3.23438V3.23438H14.7656V14.7656Z"
                                            fill="#929AAB" />
                                    </svg>
                                    <span>{{ record.count }}</span>
                                    <svg @click="handlerAdd(record)" xmlns="http://www.w3.org/2000/svg" width="18"
                                        height="18" viewBox="0 0 18 18" fill="none">
                                        <path
                                            d="M5.76563 9.5625H8.4375V12.2344C8.4375 12.3117 8.50078 12.375 8.57813 12.375H9.42188C9.49922 12.375 9.5625 12.3117 9.5625 12.2344V9.5625H12.2344C12.3117 9.5625 12.375 9.49922 12.375 9.42188V8.57813C12.375 8.50078 12.3117 8.4375 12.2344 8.4375H9.5625V5.76563C9.5625 5.68828 9.49922 5.625 9.42188 5.625H8.57813C8.50078 5.625 8.4375 5.68828 8.4375 5.76563V8.4375H5.76563C5.68828 8.4375 5.625 8.50078 5.625 8.57813V9.42188C5.625 9.49922 5.68828 9.5625 5.76563 9.5625ZM15.4688 1.96875H2.53125C2.22012 1.96875 1.96875 2.22012 1.96875 2.53125V15.4688C1.96875 15.7799 2.22012 16.0313 2.53125 16.0313H15.4688C15.7799 16.0313 16.0313 15.7799 16.0313 15.4688V2.53125C16.0313 2.22012 15.7799 1.96875 15.4688 1.96875ZM14.7656 14.7656H3.23438V3.23438H14.7656V14.7656Z"
                                            fill="#929AAB" />
                                    </svg>
                                </div>
                            </template>
                        </template>
                    </a-table>
                    <div class="pagination">
                        <a-pagination v-model:current="paginationEntity.pageNum"
                            v-model:pageSize="paginationEntity.pageSize" :show-size-changer="true" :show-quick-jumper="true"
                            :total="paginationEntity.allcount" />
                    </div>

                </div>
            </div>
            <div class="selected-plan">
                <div class="selected-user-header">
                    <div class="header-left">
                        <div class="user">
                            <span>张三</span>
                            <div class="status">已支付</div>
                        </div>
                        <span>身份证: 431129200106136229</span>
                        <span>手机号: 18563245123</span>
                    </div>
                    <div class="header-middle">
                        <span>总支付金额</span>
                        <button>{{ computedValue }}</button>
                    </div>
                    <div @click="handlerShowDrawer" class="header-right">
                        生成合同
                    </div>
                </div>
                <span style="margin-top: 10px;">照顾计划</span>
                <div class="select-table">
                    <a-table :border="true" :align="'center'" :pagination="false" style="min-height:400px"
                        :columns="columns" :data-source="selectedDataSource"
                        :row-selection="{ selectedRowKeys: selectedKeys, onChange: onSelectChange }">
                        <template #bodyCell="{ column, text, record }">
                            <template v-if="column.dataIndex == 'price'">
                                <span>{{ record.price }} 元/次</span>
                            </template>
                            <template v-if="column.dataIndex == 'operation'">
                                <div class="editor-row">
                                    <svg @click="handlerReduce(record)" xmlns="http://www.w3.org/2000/svg" width="18"
                                        height="18" viewBox="0 0 18 18" fill="none">
                                        <path
                                            d="M5.76562 9.5625H12.2344C12.3117 9.5625 12.375 9.49922 12.375 9.42188V8.57812C12.375 8.50078 12.3117 8.4375 12.2344 8.4375H5.76562C5.68828 8.4375 5.625 8.50078 5.625 8.57812V9.42188C5.625 9.49922 5.68828 9.5625 5.76562 9.5625ZM15.4688 1.96875H2.53125C2.22012 1.96875 1.96875 2.22012 1.96875 2.53125V15.4688C1.96875 15.7799 2.22012 16.0312 2.53125 16.0312H15.4688C15.7799 16.0312 16.0312 15.7799 16.0312 15.4688V2.53125C16.0312 2.22012 15.7799 1.96875 15.4688 1.96875ZM14.7656 14.7656H3.23438V3.23438H14.7656V14.7656Z"
                                            fill="#929AAB" />
                                    </svg>
                                    <span>{{ record.count }}</span>
                                    <svg @click="handlerAdd(record)" xmlns="http://www.w3.org/2000/svg" width="18"
                                        height="18" viewBox="0 0 18 18" fill="none">
                                        <path
                                            d="M5.76563 9.5625H8.4375V12.2344C8.4375 12.3117 8.50078 12.375 8.57813 12.375H9.42188C9.49922 12.375 9.5625 12.3117 9.5625 12.2344V9.5625H12.2344C12.3117 9.5625 12.375 9.49922 12.375 9.42188V8.57813C12.375 8.50078 12.3117 8.4375 12.2344 8.4375H9.5625V5.76563C9.5625 5.68828 9.49922 5.625 9.42188 5.625H8.57813C8.50078 5.625 8.4375 5.68828 8.4375 5.76563V8.4375H5.76563C5.68828 8.4375 5.625 8.50078 5.625 8.57813V9.42188C5.625 9.49922 5.68828 9.5625 5.76563 9.5625ZM15.4688 1.96875H2.53125C2.22012 1.96875 1.96875 2.22012 1.96875 2.53125V15.4688C1.96875 15.7799 2.22012 16.0313 2.53125 16.0313H15.4688C15.7799 16.0313 16.0313 15.7799 16.0313 15.4688V2.53125C16.0313 2.22012 15.7799 1.96875 15.4688 1.96875ZM14.7656 14.7656H3.23438V3.23438H14.7656V14.7656Z"
                                            fill="#929AAB" />
                                    </svg>
                                </div>
                            </template>
                        </template>
                    </a-table>
                    <div class="pagination">
                        <a-pagination v-model:current="paginationEntity.pageNum"
                            v-model:pageSize="paginationEntity.pageSize" :show-size-changer="true" :show-quick-jumper="true"
                            :total="paginationEntity.allcount" />
                    </div>
                </div>
            </div>
        </div>
    </div>
    <a-drawer v-model:visible="showDrawer" :width="720" title="照护合同" placement="right">
        <div class="grid-container">
            <div class="contract-content">
                <div>德阳市中西医结合医院（德阳市中医医院</div>
                <div>医养服务协议书</div>
                <div>甲方：德阳市中西医结合医院（德阳市中医医院）</div>
                <div>地址：德阳市天山南路二段159号</div>
                <div>法定代表人： 委托代理人：</div>
                <div>联系方式：</div>
                <div>乙方（送养人）：</div>
                <div>联 系 方式： 身份证号：</div>
                <div>丙方（入住老人）姓名： 性别：</div>
                <div>出生日期： 身份证号：</div>
                <div>地址：</div>
                <div>丁方（担保人）：</div>
                上述各方本着平等、自愿、公平、诚实信用的原则，就丙方入院事宜，在协商一致、愿意共同遵守的基础上，达成如下协议：
                <div>第一条 本协议自 年 月 日起，至丙方出院之日起自动终止或本协议终止之日止。 丙方住院期间死亡的，本协议自然终止。</div>
                <div>第二条 丙方入院试住期为 天，试住期间甲方将对丙方进一步深入评估，并将评估结果告知乙方，如乙方或丙方对评估结果有异议，而各方又不能达成一致意见的，甲方有权单方面解除入院协议，且无须承担任何责任。</div>
                <div>第三条 乙方自愿申请将丙方送入甲方德阳市中西医结合医院康养入住。在此期间，甲方有权根据医院实际情况和丙方实际需要有调换丙方床位，乙方、丙方应当给予支持和理解。</div>
                <div>第四条 根据丙方的身体状况，经甲方评估，在入住期间，乙方每月应缴费用为：基本生活护理费 元，伙食费 元，床位费 合计 元。</div>
                后续如丙方身体状况发生变化，经甲方评估需要调整费用标准的，由甲方另行通知乙方、丙方并以通知书载明金额为准。
                <div>第五条 费用结算方式：在入住期间，乙方、丙方按预缴费方式于每月15日前，提前向甲方支付丙方次月的应缴费用。</div>
                第六条 若丙方出院，甲方按实际天数结合收费标准结算总金额后收取相关费用。丙方已预交费的，费用结付执行多退少补。
                第七条 丙方入院时，须自备服装及其他日常生活用品（详见甲方入住清单）。丙方在入住期间发生损坏甲方财物、造成他人伤害、紧急救治时的临时支付等情况，由乙方、丙方全部承担或支付。
                第八条
                乙方、丙方办理入院时，应向甲方提供乙方和丙方的身份证复印件各一份、丙方近3个月内二甲及以上医院出具的健康体检报告或住院报告；同时，乙方、丙方应如实向甲方提供或陈述丙方其他相关的真实状况，如病史、生理、情感、思维、心理特征、行为特征等；若无相关报告，需按照甲方要求做基本体检（具体收费按体检标准）。
                乙方、丙方应当毫无隐瞒、如实、完整地陈述、提供丙方上述个人真实状况，否则由此产生的不利后果均由乙方、丙方自行承担。
                第九条
                乙方须真实、准确地提供自己和相关人员的信息资料，并保证通讯畅通，以便丙方出现意外等情况时，甲方能够及时通知。如乙方的联系电话或住址发生变化，须及时通知甲方。丙方所涉及的私人性质的所有家庭关系、社会关系等相关事项及纠纷及责任均与甲方无关，应由乙方、丙方自行负责处理。
                第十条
                丙方在入住期间需就医的，乙方、丙方可自由选择就医地点；但丙方突发疾病等紧急情况时，甲方可采取必要的急救、治疗措施，乙方、丙方须积极支持和配合甲方的工作。，在接受甲方通知后，乙方应及时赶到抢救现场，接手丙方的后续处置事宜，所产生的一切费用由乙方、丙方全部承担。
                第十一条 丙方服用自带药品和自备食品引起的一切后果，由乙方和丙方自行负责。
                第十二条 丙方请假外出连续或每月累计超过5天（含5天）及以上的，伙食费按天实退，但护理管理费不退还；连续或每月累计外出不足5天的，甲方不退还乙方任何费用。
                第十三条
                丙方在入住期间，因年龄、身体状况、物价波动等原因发生变化，甲方经评估后需调整护理等级、收费标准或护理区域等的，甲方将通知乙方，乙方如有异议应当在接甲方通知后3日内提出，否则视为同意，乙方则须按新标准向甲方支付费用，并及时来院完善各项手续。
                第十四条 丙方在入住期间自伤自残、伤害侮辱他人，或、损坏、偷盗、侵占公家或他人财物的，均由乙方、丙方自行负责处理并承担全部责任（如赔偿金）。
                第十五条甲方将按照护理等级向丙方提供在院内相应的护理服务，不承担乙方依法应当承担的其他法律范畴的监护责任和义务。
                第十六条 丙方在入住期间，乙方或丙方有下列情况之一者，甲方有权单方面解除本协议，且无须承担任何责任：
                1、乙方、丙方隐瞒丙方的真实病史或其他重要情况者；
                2、丙方有传染性疾病者；
                3、丙方有自伤、自残、自杀倾向，或有伤害其他人员的行为或意愿者；
                4、丙方在院期间，因身体、病情等发生了变化，需调整护理等级、收费标准或护理区域，而甲、乙丙双方又不能达成一致协议者；
                5、丙方不适应甲方的生活环境和管理要求者；
                6、乙方、丙方丧失了履约能力或不能履行义务或拖欠应缴纳费用15天及以上者；
                7、乙方、丙方行为给甲方造成较大经济损失或不良社会影响的；
                8、其他原因不宜继续入住的。
                第十七条 有下列情况者，甲方不承担责任：
                1、丙方在入住期间发生的自伤、自残、自杀、出走、猝死、突发疾病（如心脑血管意外、猝死等），以及坠地、滑倒、摔伤、烫伤、噎食、突发流行性传染病等突发意外事故者。
                2、丙方因突发疾病在紧急处置或转院过程中出现伤残或死亡者。
                3、乙方、丙方要求或本协议书约定行动不受限制的丙方外出而发生的意外情况者。
                丙方在入住期间需离院外出，乙方或丙方应当向甲方办理请假手续。若私自离院，由此而引起的一切后果，由乙方和丙方自行承担。
                乙方同意丙方外出，乙方承诺对此自行承担责任。
                4、其他非甲方原因导致乙方、丙方发生人身伤害或财产损失的。
                5、因其他不可抗拒的原因而发生的意外者。
                第十八条 入住老人因疾病发生医疗费用的结算方式：
                1、入住老人因慢性疾病或发生其他仅需门诊治疗所产生的费用按月累计，并按月提供处方、费用清单，双方核实后，门诊支付。
                2、老年患者慢性疾病加重需入院治疗时，由家属及医院双方确认后，患者转入住院医疗模式。所发生的医疗费用，按住院患者医疗支付方式进行结算。
                第十九条 担保
                1、丁方完全明了本协议书全部内容及意义，自愿为乙方、丙方的行为及后果向甲方承担连带责任保证担保。
                2、乙方、丙方因违约或违法须向甲方承担赔偿责任或支付拖欠费用的，丁方承诺：其自愿无条件代为乙方、丙方向甲方承担全部赔偿责任或给付款责任。
                3、丁方的担保期限：自本合同生效之日起至本协议解除或终止之日起3年。
                4、丁方的担保系无条件，不可撤销。
                第二十条、违约责任
                1、任何一方的违约行为或违法行为给对方造成经济损失的，向对方承担全部赔偿责任。
                2、守约方依法维权发生的律师费、公证费、保函保费由违约方负责赔偿。
                第二十一条、争议解决
                发生争议应当友好协商，协商不成的，诉交甲方所在地法院裁判。
                第二十二条、文本和效力
                本合同由上述甲乙丙丁各方签字或盖章后即生效，如丙方为完全民事行为能力人，应签字或捺印。
                第二十三条 附件及其他
                1、丙方在甲方入住期间死亡的，甲方通知乙方后，乙方应当及时处理。否则，甲方有权报告主管公安部门并依法对尸体进行处理，发生费用均由乙方承担，且甲方无需向乙方承担任何责任。
                2、本协议未尽事宜，由甲乙丙丁各方另行协商，订补充条款。
                3、以下附件同正本具有同等法律效力：
                1、甲方入住老人管理规定；
                2、物品清单：
                3、其他：
            </div>
            <div class="contract-bottom">
                <Sign :key="timeStamp" />
                <div class="btns">
                    <a-button @click="handlerReSign">重新签名</a-button>
                    <a-button @click="handlerDialog" style="background-color: #54B674;color: #fff">提交签名</a-button>
                </div>
            </div>
        </div>
    </a-drawer>
    <div class="dialog" v-if="showDialog">
        <WeChatDialog :payStr="payStr" :money="computedValue" @cancel="cancel" />
    </div>
</template>
<script lang="ts" setup>
import { computed, ref, onMounted } from 'vue'
import WeChatDialog from '@/components/Dialog/WechatDialog.vue'
import Sign from './Sign.vue'
import {CarePlanStore} from '@/store/careplan.store'

const careplanStore = CarePlanStore()
const canvasElement = ref<any>()

const payStr=ref("")

const timeStamp = ref(new Date().getTime())

const showDialog = ref(false)

const handlerReSign = ()=>{
    timeStamp.value = new Date().getTime()
    careplanStore.base64Data = ""
}

const handlerDialog = () => {
    const token = window.localStorage.getItem("token")
    // showDrawer.value = false
    // showDialog.value = true
    fetch("/api/care/addPlan",{
        headers:{
            'Content-type': 'application/json',
            token: token+""
        },
        method: 'POST',
        body: JSON.stringify({
            recordsId: careplanStore.userId,
            sign: careplanStore.base64Data,
            carePlanContentList: selectedDataSource.value.map(ele=>{
                return {
                    recordsId: careplanStore.userId,
                    planId: ele.planId,
                    projectId: ele.projectId,
                    projectName: ele.projectName
                }
            })
        })
    }).then(res=>res.json())
    .then(data=>{
        payStr.value = data.data.orderId+","+data.data.planId
        showDrawer.value = false
        showDialog.value = true
    })
}
const cancel = () => {
    showDialog.value = false
}

const showDrawer = ref(false)

onMounted(() => {
    loadData()
})

const headerTypes = ref<any>([])

const loadData = () => {
    const token = window.localStorage.getItem("token")
    fetch("/api/careManage/getMenuTree", {
        method: 'GET',
        headers: {
            'Content-type': 'application/json',
            token: token + ""
        }
    }).then(res => res.json())
        .then(data => {
            headerTypes.value = data.data
        })
}



const handlerReloadList = (item)=>{
    if(item.careProject == null){
        return
    }
    dataSource.value = item.careProject.map((ele,index)=>{
        return {
            index: index+1,
            count: 0,
            ...ele
        }
    })
}

const handlerShowDrawer = () => {
    showDrawer.value = true
}

const handlerAdd = (record) => {
    const operationIndex = record.index - 1
    dataSource.value[operationIndex].count++
    const findIndex = selectedDataSource.value.findIndex(ele=>ele.projectName==dataSource.value[operationIndex].projectName)
    if(findIndex!=-1){
        selectedDataSource.value.count++
    }else{
        selectedDataSource.value.push(dataSource.value[operationIndex])
    }
    
}
const handlerReduce = (record) => {
    const operationIndex = record.index - 1
    if (dataSource.value[operationIndex].count == 0) {
        return
    }else{
        const findIndex = selectedDataSource.value.findIndex(ele=>ele.projectName==dataSource.value[operationIndex].projectName)
        selectedDataSource.value[findIndex].count--
        dataSource.value[operationIndex].count--
    }
}

const paginationEntity = ref<any>({
    pageNum: 1,
    allCount: 50,
    pageSize: 5
})

const dataSource = ref<any>([])

const selectedDataSource = ref<any>([])
const selectedKeys = ref<any[]>([])

const onSelectChange = (selectedRowKeys: any[]) => {
    selectedKeys.value = selectedRowKeys
}

const columns = ref<any>([
    {
        title: '序号',
        dataIndex: 'index',
        align: 'center',
        key: 'index'
    },
    {
        title: '项目名称',
        dataIndex: 'projectName',
        align: 'center',
        key: 'projectName'
    },
    {
        title: '价格',
        dataIndex: 'price',
        align: 'center',
        key: 'price'
    },
    {
        title: '次数',
        dataIndex: 'operation',
        align: 'center',
        key: 'operation'
    }
])

const computedValue = computed(() => {
    let money = 0
    for (let i = 0; i < selectedDataSource.value.length; i++) {
        money += selectedDataSource.value[i].count * selectedDataSource.value[i].price
    }
    return money
})
</script>
<style lang="scss" scoped>
.item-list{
    display: flex;
    flex-direction: column;
    align-items: center;
    gap: 4px;
    .item{
        width: 100%;
        cursor: pointer;
    }
}
.grid-container {
    width: 100%;
    height: 100%;
    display: flex;
    flex-direction: column;
    gap: 10px;
    box-sizing: border-box;
    padding: 10px;

    .contract-content {
        width: 100%;
        height: 70%;
        border: 1px solid #eee;
        overflow: scroll;
        box-sizing: border-box;
        padding: 10px;
    }

    .contract-bottom {
        width: 100%;
        height: 30%;
        display: flex;
        flex-direction: column;

        .sign {
            width: 100%;
            height: 70%;
            border: 1px solid #eee;
            background-color: #eee;
            padding: 10px;
        }

        .btns {
            width: 100%;
            height: 30%;
            display: flex;
            margin-top: 10px;
            flex-direction: row;
            justify-content: space-between;
        }
    }
}

.editor-row {
    align-items: center;
    display: flex;
    flex-direction: row;
    justify-content: center;
}

.careplan-add {
    width: 100%;
    height: 100%;
    box-sizing: border-box;
    display: flex;
    flex-direction: column;

    .careplan-add-body {
        width: 100%;
        min-height: 400px;
        display: flex;
        flex-direction: row;
        gap: 55px;

        .select-plan {
            width: 50%;
            background-color: #fff;
            height: 100%;
            box-sizing: border-box;
            padding: 10px 30px;
            border-radius: 10px;


            .selected-header {
                width: 100%;
                height: 80px;
                border-bottom: 1px solid #eee;
                box-sizing: border-box;
                display: flex;
                flex-direction: row;
                gap: 10px;

                .header-item {
                    display: flex;
                    flex-direction: row;
                    gap: 5px;
                    align-items: center;
                    cursor: pointer;

                    .header-item-container {
                        display: flex;
                        flex-direction: row;
                        align-items: center;
                        gap: 7px;
                        align-items: center;
                    }
                }
            }

            .select-table {
                width: 100%;
                height: auto;
                box-sizing: border-box;
                padding: 20px 20px;
                display: flex;
                flex-direction: column;

                .pagination {
                    width: 100%;
                    display: flex;
                    flex-direction: row;
                    margin-top: 10px;
                    justify-content: center;
                }
            }
        }

        .selected-plan {
            background-color: #fff;
            width: 50%;
            height: 100%;
            box-sizing: border-box;
            padding: 10px 30px;

            .selected-user-header {
                width: 100%;
                height: 80px;
                display: flex;
                flex-direction: row;
                gap: 30px;
                border-bottom: 1px solid #eee;
                align-items: center;

                .header-left {
                    display: flex;
                    flex-direction: column;
                    gap: 5px;
                    font-size: 8px;

                    .user {
                        display: flex;
                        flex-direction: row;
                        gap: 5px;
                        align-items: center;

                        .status {
                            width: 40px;
                            height: 20px;
                            border-radius: 1px;
                            background: #A0D6B2;
                            text-align: center;

                        }
                    }
                }

                .header-middle {
                    display: flex;
                    flex-direction: row;
                    gap: 10px;
                    align-items: center;
                }

                .header-right {
                    width: 98px;
                    height: 35px;
                    display: flex;
                    flex-direction: column;
                    justify-content: center;
                    align-items: center;
                    cursor: pointer;
                    font-size: 14px;
                    color: #fff;
                    background-color: #54B674;
                }
            }

            .select-table {
                width: 100%;
                height: auto;
                box-sizing: border-box;
                padding: 20px 20px;
                display: flex;
                flex-direction: column;

                .pagination {
                    width: 100%;
                    display: flex;
                    margin-top: 10px;
                    flex-direction: row;
                    justify-content: center;
                }
            }
        }
    }
}
</style>